[
    {
        "title": "13 Sentinels: Aegis Rim",
        "genre": "adventure",
        "difficulty": "average",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "full",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2uls.jpg",
        "backloggd": "https://www.backloggd.com/games/13-sentinels-aegis-rim/",
        "howlongtobeat": "https://howlongtobeat.com/game/30314",
        "playtime": "average",
        "notes": "\n\n\nThe game is an absolute masterpiece of narrative and will keep you glued to the story until the very end (at least it did for me). I consider it the equivalent of \"one more turn\" memes from the Civilization strategy games, except in an adventure form (\"one more dialogue\").\n\n\n\nWhile the game itself presents a story that is very convoluted and shown from the point of view of many characters (of which the player can decide the playthrough order), in reality the game does a very good job at presenting it in a very linear fashion. Chronologically, it can get very confusing to know who did what in which order but it's part of the charm of the game, and even if you don't fully understand all details of the story you can still more or less easily navigate the scenarios and reach the end without getting stuck.\n\n\n\nIt has some combat portions as in some parts it becomes a fully fledged real time tower-defense-like game, and at that point I felt like the difficulty in the language spiked quite a bit. There are a lot of skills, a lot of upgrade systems, a lot of mechanics, and overall I did not personally find that part very enjoyable. For that reason I just played it on \"casual\" difficulty so I could focus on the story which is what interested me the most. If you are like me and struggle with the battle parts, I recommend doing the same as you won't regret it.\n\n\n\nThe dialogue in this game is for the most part \"pausable\" as it waits for your input to continue, so you can read it somewhat leisurely, however there are some parts that are somewhat \"timed\". This is because as you proceed through dialogues, there sometimes are some other scenes happening in the background as other characters go do their own things, and if you don't read fast enough and interact with them before they are gone, you will get locked into a specific route. But the game makes it easy enough to go back and retry, so I wouldn't worry too much about it.\n\n\n\nThe ending dialogue, however, is completely unpausable and I found it a bit frustrating. There's a bit of lore dump as you get explained a lot of crucial parts of the plot with some complex words and you cannot pause it, but overall it's not too bad if you managed to get that far.\n\n\n\nOverall, the lack of furigana hurts a bit, but the fact that the game is entirely voiced and aside a few sci-fi terms sprinkled throughout the story, I'd say the language difficulty is pretty average for this kind of adventure game.\n",
        "browsable": true
    },
    {
        "title": "428: Shibuya Scramble",
        "genre": "visual novel",
        "difficulty": "average",
        "furigana": "partial",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "no",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co28rd.jpg",
        "backloggd": "https://www.backloggd.com/games/428-shibuya-scramble/",
        "vndb": "https://vndb.org/v1299",
        "howlongtobeat": "https://howlongtobeat.com/game/51898",
        "playtime": "average",
        "notes": "\n\n\nLet me preface that I did not complete this game, I stopped playing halfway through because I simply lost interest. It wasn't a bad game or anything, but I just had too much other stuff going on and I decided to not continue with it. I still played a decent chunk (tens of hours) to know how the game plays out and be familiar with the language, I just didn't finish the story.\n\n\n\nThe game is an interesting mix of VN and adventure as you jump between different timelines and perspectives to solve a police case. Different choices you make at different points in time with certain characters will affect how the story plays out for other characters. For this reason, it's great to test your understanding of the language and has that aspect of lite point-and-click adventure game that tickles that specific part of the brain. On the other hand, you can always go back and rewind/retry multiple choices and see how they play out, so  you will never feel like you messed up (although some choices are a bit obscure or hidden in codex menus or stuff like that).\n\n\n\nThe language is also surprisingly approachable. I wouldn't say it's easy, but it's very kana-heavy and the usage of kanji is very limited to common words and things that most younger people would know so it's good to practice on it. There are some specific words that relate to the police/detective genre but after playing for a bit you should get used to them soon enough.\n\n\n\nThere is some furigana, mostly for some names, but it's not really used outside of that. Most words will not have any furigana at all.\n\n\n\nOne downside is that aside from some very limited live-action cutscenes with some dialogue, the entire game is completely unvoiced. You have to read everything, including dialogues between characters. I thought it was an odd choice considering how every character is actually played by an actor (real person) and the game leans very much into the live action style.\n\n\n\nA strong point for the game is that it has a codex system where it explains a lot of words, sometimes even common everyday words, with a definition that is relevant to the story. It's kind of like its own pop up dictionary inside the game. It's not always there, but when it is I recommend reading it (also it becomes relevant in some puzzles).\n",
        "browsable": true
    },
    {
        "title": "Aiyoku no Eustia",
        "genre": "visual novel",
        "difficulty": "average",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co3dhl.jpg",
        "backloggd": "https://www.backloggd.com/games/aiyoku-no-eustia/",
        "vndb": "https://vndb.org/v3770",
        "jpdb": "https://jpdb.io/visual-novel/963/aiyoku-no-eustia",
        "howlongtobeat": "https://howlongtobeat.com/game/63184",
        "playtime": "long",
        "notes": "\n\n\nEustia is probably one of the most widely acclaimed VNs out there. If you are into dark fantasy stories and want some real good time with some enthralling story, this is the VN for you. I'm still riding on the high of this narration and I wish more VNs were like this. As someone who does not enjoy slice of life and time wastes with filler events in VNs, Eustia hit all the right spots for me.\n\n\n\nLanguage-wise, I was conflicted on whether to consider it \"average\" or \"hard\". I opted to go with \"average\" because realistically speaking the level of language used in it is not that different from most average VNs, however as a beginner I remember struggling quite a bit with it and I had to postpone it and come back to it after a few years.\n\n\n\nThe VN is mostly voiced for all dialogues (including the protagonist), however as is usual for the majority of VNs, it doesn't have voices for narration.\n\n\n\nThere is some furigana mostly used for made-up words, ornamental purposes, and for the occasional rare kanji vocab.\n\n\n\nKanji-wise, it sometimes uses alternative forms for some words (like 水甕 instead of 水瓶) but for the most part it's relatively straightforward.\n",
        "browsable": true
    },
    {
        "title": "Dragon Quest X Offline",
        "genre": "jrpg",
        "difficulty": "easy",
        "furigana": "partial",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co6l19.jpg",
        "backloggd": "https://www.backloggd.com/games/dragon-quest-x-offline/",
        "playtime": "unknown",
        "backlog": "unknown",
        "notes": "\n\n\nDragon Quest X Offline (not to be confused with the online version) is a remake of the Dragon Quest X online MMO but meant to be played offline as a single player campaign. The story and world is the same as the MMO version, however the gameplay is slightly different. One thing that differs from the online version is that it also has an option to turn on furigana in every dialogue. This makes it quite interesting for beginners and is very beginner friendly.\n\n\n\nThere are however two downsides that I want to point out:\n\n\n\nThe “full” furigana option does not cover things like quest logs and tutorial windows, so those can be quite hard/tricky to read. Especially if you are lost with a certain quest and don’t know where to go.\n\n\n\nAs is normal Dragon Quest tradition, there’s a lot of puns, and most characters speak with some weird speech quirks and accents which can be quite hard to understand as a non-native speaker.\n\n\n\nFor this reason, while it looks like a child/beginner friendly game, it might not be as easy once you get deeper into it.\n",
        "browsable": true
    },
    {
        "title": "EVE: Burst Error R",
        "genre": "visual novel",
        "difficulty": "average",
        "furigana": "not supported",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co60qe.jpg",
        "backloggd": "https://www.backloggd.com/games/eve-burst-error-r/",
        "vndb": "https://vndb.org/v147",
        "howlongtobeat": "https://howlongtobeat.com/game/18825",
        "playtime": "long",
        "notes": "\n\n\nEVE Burst Error R is a remake of an old PC-98 visual novel from 1995. The original game presented adult scenes, but the remake got rid of all of them, however there are still plenty of scenes I wouldn't want to watch in front of my parents. Some characters are often very... scantily clad.\n\n\n\nOverall the game difficulty is that of your average visual novel. Kanji-wise I did not see anything too complicated or hard to read. This is a common sign in older games (or remaster of older games) as they used to use less rare kanji due to font size and memory limitations.\n\n\n\nThis said,  there is no furigana support at all. Some rare words will sometimes have the reading in brackets next to them, but the engine itself does not support furigana.\n\n\n\nThe game is fully voiced for all characters outside of the two main characters. There is this interesting mechanic where the player can swap between the two main characters (each of them having individual storylines that run in parallel and sometimes cross paths), however the really frustrating part is that your other main character will be voiced when they show up in a story portion where you are not controlling them, but will go back to being mute the moment you control them (sometimes in the same scen etoo). I really wish they stuck with having it fully voiced no matter what.\n\n\n\nObviously, narrative sequences are also unvoiced.\n\n\n\nThe game presents itself as some lite point and click adventure game as you move around different areas and pick options to interact with and dialogue trees with various characters. It is not particularly complicated, however I recommend turning on the \"hints\" setting in the options, which will make it clear where you have to go as you transition from area to area. Without that, the game would've felt much more frustrating to navigate for me.\n\n\n\nIn general, if you are okay with an average-difficulty visual novel and are into mystery investigative thriller stories, I think this game would be pretty good for you.\n",
        "browsable": true
    },
    {
        "title": "Final Fantasy VII",
        "genre": "jrpg",
        "difficulty": "average",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "no",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2kx2.jpg",
        "backloggd": "https://www.backloggd.com/games/final-fantasy-vii/",
        "howlongtobeat": "https://howlongtobeat.com/game/3521",
        "playtime": "long",
        "notes": "\n\n\nThis is THE JRPG. The classic. The one, true, and only Final Fantasy VII. It's such an amazing game.\n\n\n\nLanguage-wise, this game is surprisingly not that complicated. It falls in the category of old(er) JRPGs where due to language/font limitations they didn't use a lot of weird or unknown kanji, however it also does not plaster your face with full kana which is good. If you are average at reading Japanese text and know your fair share of jouyou kanji, I think you will do fine with the vocabulary in this game.\n\n\n\nThe downside is that since it's an older game, there are no quest markers or UI indicators to aid you in your quest and if you cannot follow the story (or play with a walkthrough), you will likely feel a bit lost. There is also no voice acting and no backlog.\n\n\n\nOverall, I was conflicted if I should rate this as \"easy\" rather than \"average\" in difficulty, but I chose \"average\" due to the length. Had it been a shorter and more linear game, I'd have definitely considered it \"easy\".\n",
        "browsable": true
    },
    {
        "title": "Final Fantasy VII Rebirth",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "no",
        "voiced": "full",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co73ju.jpg",
        "backloggd": "https://www.backloggd.com/games/final-fantasy-vii-rebirth/",
        "howlongtobeat": "https://howlongtobeat.com/game/109434",
        "playtime": "very long",
        "notes": "\n\n\nThe game is a sequel to FF7 Remake. The difficulty is mostly the same, however the amount of text and length of the game overall makes it slightly harder than its predecessor in my opinion. The combat system is also a bit more complicated and if you were overwhelmed by the skill system of its predecessor, this one will probably be a bit worse.\n\n\n\nLanguage-wise, it is not particularly hard but for a learner it might feel overwhelming. There is pretty much no furigana that I can remember, and there is no way to pause the text (unless you pause the entire game) or to scroll back to previous text logs as there is no dialogue history. On top of that, you often have dialogue from random NPCs in the various towns that is hard to track if you are the kind of person that pays attention to all those details.\n\n\n\nOn the good side, everything is fully voiced, including the most minor NPC interactions, which is very good to see. Also, the map is very clear with quest markers and events and makes it very obvious where you need to go, so even if you can't understand what characters are saying, you will always know where to go.\n",
        "browsable": true
    },
    {
        "title": "Final Fantasy VII Remake",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "no",
        "voiced": "full",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1qxr.jpg",
        "backloggd": "https://www.backloggd.com/games/final-fantasy-vii-remake/",
        "jpdb": "https://jpdb.io/video-game/5506/final-fantasy-7-remake",
        "howlongtobeat": "https://howlongtobeat.com/game/57686",
        "playtime": "long",
        "notes": "\n\n\nThis game is the remake of the original FF7 (the first part at least) with A LOT of extra content and sidequests and dialogues. While I think the original was pretty average in language difficulty, I think the remake series of games can be significantly harder to follow. The dialogue is not pausable, as all converastions are voiced and in real time, and there is no backlog to refer to in case you feel lost.\n\n\n\nThe language itself (word choice, etc) is not particularly complex after you become familiar with some in-universe words, as is common for most JRPGs. I'd still consider it to be on the hard end of JRPGs due to how \"active\" and non-pausable it is in nature.\n",
        "browsable": true
    },
    {
        "title": "Final Fantasy XVI",
        "genre": "jrpg",
        "difficulty": "very hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "no",
        "voiced": "full",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co5w3k.jpg",
        "backloggd": "https://www.backloggd.com/games/final-fantasy-xvi/",
        "howlongtobeat": "https://howlongtobeat.com/game/83152",
        "playtime": "long",
        "notes": "\n\n\nThe Japanese in this game is quite hard and it does not mess around. It is entirely voiced, including every single background interaction between random NPCs, and the text is not pausable. This means you will have to keep up without being able to look up many unknown words, especially during certain action cutscenes and QTEs that require your full attention.\n\n\n\nVocabulary-wise, it also uses quite a bit of complicated words, as it takes place in a fantasy pseudo-medieval european-style land but with some sci-fi technology. The two main villains also speak in a bit of fancy and archaic Japanese, and so do a lot of other (especially noble) characters.\n\n\n\nTo make things worse, the game script in English is almost completely different from the Japanese, so if you are the kind of person that wants to look up a translation to follow the story, you're not going to have a good time with this one.\n",
        "browsable": true
    },
    {
        "title": "Furikake Spacey",
        "genre": "visual novel",
        "difficulty": "very hard",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "no",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co6y96.jpg",
        "backloggd": "https://www.backloggd.com/games/furikake-spicy/",
        "vndb": "https://vndb.org/v37548",
        "furigana": "unknown",
        "playtime": "unknown",
        "notes": "\n\n\nThis VN is the literal definition of a fever dream. It is chock-full of references, inside jokes, slang, and incredibly hard self-referential Japanese. The specific word choice is not particularly hard, as in, it doesn't use particularly complicated or archaic kanji, but it makes up for it by the incredibly dense structure of rapid fire jokes and references to both contemporary (Japanese) internet memes, and older historical (showa era) memes.\n\n\n\nFor this reason, I consider this to be very hard. If you want a challenge into Japanese humor and internet culture, this VN is right for you. Also the artstyle is amazing.\n",
        "browsable": true
    },
    {
        "title": "Ihanashi no Majo",
        "genre": "visual novel",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co5bz5.jpg",
        "backloggd": "https://www.backloggd.com/games/the-witch-of-the-ihanashi/",
        "vndb": "https://vndb.org/v32758",
        "howlongtobeat": "https://howlongtobeat.com/game/145111",
        "playtime": "average",
        "notes": "\n\n\nThis is a kinetic visual novel (= pretty much no choices) and it takes place in a somewhat remote island around Okinawa. It touches a lot of Okinawan/Ryuukyuu folklore, and uses a lot of words that are specific to Okinawan culture. For this reason, I consider it to be harder than your average visual novel. The actual grammar and complexity of the language is relatively low, however the game throws at you names of certain folk gods and temples and other ritual stuff that can feel a bit overwhelming at times.\n\n\n\nThe story itself is structured in a few arcs, and the first couple are mostly just slice of life comfy stuff happening in the (island) countryside. However, later on the story becomes more serious and it starts to get into the more complicated plot parts, and that's where the difficulty comes out.\n\n\n\nI think it's worth it to give it a try just for the slice of life parts, and by the time you get to the more complicated portions, maybe you'll be so invested in the story it will not feel like it is too hard.\n",
        "browsable": true
    },
    {
        "title": "Kanna Maze",
        "genre": "visual novel",
        "difficulty": "hard",
        "furigana": "not supported",
        "japanese_game": "no",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co87p5.jpg",
        "backloggd": "https://www.backloggd.com/games/kanna-maze/",
        "vndb": "https://vndb.org/v50648",
        "playtime": "short",
        "notes": "\n\n\nFor the extremely cheap price of this VN on Steam, I think this is an insane amount of value you can get out of it. I really enjoyed this VN a lot and was very unexpected, given how cheap it was to buy.\n\n\n\nThe VN does not support any furigana at all, and often makes use of complicated words and unusual kanji sometimes, but the good thing is that all the dialogues from all the characters (including the protagonist) are fully voiced. The narration parts aren't voiced though, unfortunately.\n\n\n\nThe story is very interesting and encourages the player to explore every single option and alternative choices in a somewhat complicated path tree, and at any point in time you can go back and re-play certain parts (you're actually expected to). This is great for people who might miss a dialogue or two or just in case you miss a core part of the plot and want to re-read it. There is no explicit save feature because the game unlocks parts of the story as you play them and once you unlock them you can go back to them at any time automatically.\n\n\n\nThe core gameplay loop revolves around you going through the story and reaching a certain ending, then rewinding the story and going down a different path. Initially some choices are locked and you can only unlock them by witnessing certain endings, until you reach the one true ending.\n\n\n\nThe language touches upon a lot of scientific jargon like physics, quantum mechanics, dark matter, etc, but most of the complex concepts are explained directly so as long as you can follow you shouldn't feel too lost.\n\n\n\nA downside of the way the game is narrated is that a lot of descriptions are formatted like a book, with dialogue interspersed with descriptions. This somewhat interferes with the voice acting a bit as the voices skip over the descriptions and move towards the next line of dialogue, but if you are a slow reader you will still be reading the description and might feel lost. But at least you can always replay the voiced cue from the backlog.\n\n\n\nAnother downside is that the game is not natively Japanese, however I have to say I did not feel like the text felt out of place and the translation seems excellent. The story also takes place in a real part of Japan with real buildings and setting so it was clearly developed with Japan and a Japanese audience in mind. There are some weird quirks in the backlog that show it's not a Japanese developer, like sometimes the backlog uses a Chinese font (normal textboxes use a Japanese font), and sometimes there's some weird romaji (like 警察 was written as KESATSU) but they are very minor things.\n\n\n\nOverall, I think the level of language in this VN is hard due to the complex words and explanations, but it's a very good and engaging VN and if you are into this kind of multiple-choice thriller/horror narrative style I'm sure you will enjoy this one. I was very surprised at how highly I ended up rating this hidden gem.\n",
        "browsable": true
    },
    {
        "title": "Monochrome Mobius",
        "genre": "jrpg",
        "difficulty": "average",
        "furigana": "partial",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co4oxm.jpg",
        "backloggd": "https://www.backloggd.com/games/monochrome-mobius-rights-and-wrongs-forgotten/",
        "howlongtobeat": "https://howlongtobeat.com/game/109901",
        "playtime": "long",
        "backlog": "unknown",
        "notes": "\n\n\nMonochrome Mobius is a spin off entry of the Utawarerumono franchise. It tells the story of some of the main cast from Utawarerumono: Mask of Deception and takes place between the ending of Utawarerumono: Prelude to the Fallen and the beginning of Mask of Deception. However, I very strongly recommend playing this only after you have played the mainline Utawarerumono trilogy.\n\n\n\nThe game spoils a lot of plot elements from the mainline Utawarerumono games, and has so many references and cameos to the main series that would be missed or not enjoyable to those who aren't already fans of the series.\n\n\n\nThe game itself is not bad, but it's very rough on the edges. It has quite a few interesting gameplay elements, but a lot of it feels a bit janky and not very polished. The story is very enjoyable but I suspect a lot of it is because of the characters who I already grew familiar with thanks to the mainline games. If you just want a JRPG to play and don't care about the franchise, you might end up disappointed with this one.\n\n\n\nSimilarly to my description of Utawarerumono: Prelude to the Fallen, I'd say the language in this game is of average difficulty for a JRPG. The same worldbuilding elements of the mainline series are present in this one too, including some of the weird kanji, speech quirks, and katakana words.\n",
        "browsable": true
    },
    {
        "title": "Octopath Traveler II",
        "genre": "jrpg",
        "difficulty": "average",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co7ds7.jpg",
        "backloggd": "https://www.backloggd.com/games/octopath-traveler-ii/",
        "howlongtobeat": "https://howlongtobeat.com/game/113582",
        "playtime": "long",
        "furigana": "unknown",
        "backlog": "unknown",
        "notes": "\n\n\nLanguage-wise, I'd say the game is of average difficulty. If you've played other JRPGs before, you will probably have no issues following this one too.\n\n\n\nThe gameplay/combat is not particularly complicated and the skill descriptions are pretty straightforward.\n\n\n\nUnfortunately not all dialogues are voiced, even in the main story quest you get a decent chunk of grunting and unread text boxes which raise the difficulty a bit. Also, some characters speak with funny accents.\n",
        "browsable": true
    },
    {
        "title": "Paper Mario: The Origami King",
        "genre": "jrpg",
        "difficulty": "easy",
        "furigana": "full",
        "japanese_game": "yes",
        "voiced": "no",
        "pausable_text": "all",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2sai.jpg",
        "backloggd": "https://www.backloggd.com/games/paper-mario-the-origami-king/",
        "howlongtobeat": "https://howlongtobeat.com/game/78187",
        "playtime": "average",
        "backlog": "no",
        "notes": "\n\n\nVery cute game. The gameplay itself is quite straightforward and not that complex (it is a kids game after all). Some of the battles with bosses become tricky later on and there are explanations/notes on how to solve them, so testing your understanding of the language is actually quite useful.\n\n\n\nThe game has full furigana support and is relatively easy to follow. There’s a few instances of weird speech (either archaic or some other speech quirks) but for the most part it shouldn’t be too hard. There are a few word puzzles and trivia with wordplays that might get tricky but, again, it’s a good test of understanding.\n",
        "browsable": true
    },
    {
        "title": "Pokémon Scarlet",
        "genre": "jrpg",
        "difficulty": "very easy",
        "furigana": "full",
        "japanese_game": "yes",
        "voiced": "no",
        "pausable_text": "all",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co5sfi.jpg",
        "backloggd": "https://www.backloggd.com/games/pokemon-scarlet/",
        "howlongtobeat": "https://howlongtobeat.com/game/104683",
        "playtime": "unknown",
        "notes": "\n\n\nSame as Sword/Shield, these pokemon games are also a good entry place for beginners. Unlike Sword/Shield which do not have furigana, these entries have support for a furigana option which might make them even better as an entry point compared to the previously mentioned ones.\n",
        "browsable": true
    },
    {
        "title": "Pokémon Shield",
        "genre": "jrpg",
        "difficulty": "easy",
        "furigana": "kana mode",
        "japanese_game": "yes",
        "voiced": "no",
        "pausable_text": "all",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1zk1.jpg",
        "backloggd": "https://www.backloggd.com/games/pokemon-shield/",
        "howlongtobeat": "https://howlongtobeat.com/game/65235",
        "backlog": "no",
        "playtime": "unknown",
        "notes": "\n\n\nIn general, the Pokemon series is always recommended for beginners. I only played this one in Japanese so I can’t say much about the rest. The only thing I strongly advise against are the very first Pokemon games (on GameBoy). Those do not use any kanji and the kana is super small due to display size limitations, it’s extremely hard for beginners to recognise where words start and end. You will not have a good time.\n\n\n\nThis said, Pokemon Sword/Shield are on the other hand excellent and very easy to follow for the most part. Despite being RPGs, the story is very linear and even if you end up not understanding some plot points, you will almost never be “stuck” on a puzzle or not knowing where to go.\n\n\n\nA big downside however, if you are used to the English version of these games or Pokemon in general, is that a lot of Pokemon name and combat moves are significantly different. So you might feel a bit lost when it comes to Pokemon names (and they are always full of puns you might not understand yet).\n\n\n\nBe sure to play the game with kanji and not in kana only (there’s different options in the settings). You’ll still get a lot of kana, but at least the kanji will help.\n",
        "browsable": true
    },
    {
        "title": "Reynatis",
        "genre": "jrpg",
        "difficulty": "average",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co7t22.jpg",
        "backloggd": "https://www.backloggd.com/games/reynatis/",
        "howlongtobeat": "https://howlongtobeat.com/game/145852",
        "playtime": "average",
        "notes": "\n\n\nReynatis is what I like to call B-tier \"jankcore\" action JRPG. I wouldn't say that the game itself is bad, I enjoyed it more than I thought I would, but it is definitely an acquired taste.\n\n\n\nThe game becomes enjoyable once you get into the loop of things, however it's full of rough edges and jank game designs at every corner, some of which will also affect how approachable it is for Japanese learners.\n\n\n\nThere is no backlog whatsoever in the game, even for stuff like side-quest tracking it is hard to look at the progress or where you need to go next. If you misread or skip reading an explanation from an NPC, it can be troublesome sometimes. There are quest markers, but in some situations they disappear or glitch out, and at that point if you missed the initial explanation, looking up a guide is the only way to get you unstuck.\n\n\n\nThe biggest issue I have with this game, especially as a parent with a toddler who constantly interrupts my gaming sessions, is that you cannot pause cutscenes. The \"start\" button skips them straight up without warning. So be careful if you try to pause things to look words up or anything like that. You can use the feature on your console (PS5 or Switch) to record the last few seconds of gameplay and re-play the cutscene back if you miss or misunderstand a sentence, but it's a bit of a pain.\n\n\n\nAn unexpected point of pain for me was also the fact that there's many characters with kanji names and as someone who is not good at reading names it was a bit of a struggle sometimes. Especially when the characters would refer to each other with nicknames or abbreviations, but then have their full name dropped in a dialogue that makes you confused about who they are talking about.\n\n\n\nOn the other hand, the game has a SNS (social media) chat system where the party members chat with each other after every event in the story and that is absolutely great to pick up some really funny casual Japanese conversations. The jokes and quipping between characters made me laugh more than a couple of times.\n\n\n\nThe game also has a few collaboration events with other games/franchises (at the time of writing only the TWEWY one is available but I think more are planned). Word of advice: DO NOT start these side-quests until you have finished the main story. I made the mistake of starting it early and it spoiled a few things because the game assumes you've already reached certain parts in the story.\n\n\n\nOverall, I think the game's Japanese is not very complicated, there's a few odd and specific words here and there but nothing out of the ordinary. It's decently voice-acted for most of the main story and has a few hiccups in game design and UI that could be better, but I'd say its difficulty is pretty average for a JRPG.\n",
        "browsable": true
    },
    {
        "title": "Shin Megami Tensei V: Vengeance",
        "genre": "jrpg",
        "difficulty": "average",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co7sv4.jpg",
        "backloggd": "https://www.backloggd.com/games/shin-megami-tensei-v-vengeance/",
        "howlongtobeat": "https://howlongtobeat.com/game/145836",
        "playtime": "unknown",
        "notes": "\n\n\nI'll be honest, I did not like this game and I dropped it after about 15-20 hours or so.\n\n\n\nGameplay aside, story-wise the game seemed okay. I was actually getting interested in the story but... unfortunately it felt like there wasn't enough story between the mindless gameplay/battle portions.\n\n\n\nThe game also felt very frustrating to read as a lot of demons speak with weird speech quirks or weird speech styles (like all katakana, etc). Every interaction you have, you have to sit through all these demons speaking in very annoying ways.\n\n\n\nThe language itself also often uses difficult kanji or grammar.\n\n\n\nThis said, I still put it on \"average\" difficulty because despite all this, most of the narrative portions that don't involve talking with random demons actually use pretty normal Japanese, and there's not much reading anyway so it's hard to get lost.\n\n\n\nIf you like the SMT type of dungeon crawling and some pseudo open world/open area type of gameplay, maybe this game is for you. For me, unfortunately, I didn't enjoy it much.\n",
        "browsable": true
    },
    {
        "title": "Snack World: The Dungeon Crawl - Gold",
        "genre": "dungeon crawler",
        "difficulty": "very easy",
        "furigana": "full",
        "japanese_game": "yes",
        "voiced": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co2vxp.jpg",
        "backloggd": "https://www.backloggd.com/games/snack-world-the-dungeon-crawl-gold/",
        "howlongtobeat": "https://howlongtobeat.com/game/75319",
        "playtime": "unknown",
        "backlog": "unknown",
        "pausable_text": "unknown",
        "notes": "\n\n\nI played this game a long time ago. It’s a pretty cute game overall.\n\n\n\nThe grammar is relatively simple and it’s all with furigana so kanji shouldn’t be an issue. There are a lot of puns about food (mostly) with character and enemy names. The mechanics are very simple in general and if you like dungeon crawling light-hearted action RPGs, I think you will enjoy this.\n",
        "browsable": true
    },
    {
        "title": "Star Ocean: The Divine Force",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "not supported",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "full",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co45km.jpg",
        "backloggd": "https://www.backloggd.com/games/star-ocean-the-divine-force/",
        "howlongtobeat": "https://howlongtobeat.com/game/99491",
        "playtime": "average",
        "notes": "\n\n\nThe sixth installment of the Star Ocean franchise. At first I was a bit put off by the graphics/visuals and some of the reviews, but honestly once I started playing (and looked past the jank animations and lip syncing), the game was really really fun to play. The story as well was quite enjoyable.\n\n\n\nSpeaking of the story, it touches a lot of complex sci-fi topics with hard sci-fi words. Comparing it to Star Ocean The Second Story R, I'd say this one has much more complex language. On top of that, there is no furigana even for some of the most sci-fi words that are often read in-game with katakana by the voice actors, despite the word being in kanji (for example 艦橋 being pronounced ブリッジ) which can be quite confusing. The strong point though is that it is entirely voiced, including random NPC chatter and side content.\n\n\n\nThere is no backlog and most of the conversations are happening in real time which makes it hard to follow sometimes, but the start button pauses the entire screen (and does not hide or impede the view with any visible pause menu) which makes it easy to look up any words you don't know.\n\n\n\nSome of the private action (think like \"skits\" or side conversations with party members) sometimes require you to choose a (timed) option out of a couple of choices, but in my experience the timing is very generous and the choices don't matter much (aside from some flavor dialogue).\n\n\n\nThe menus aren't very complicated, much simpler than the ones in Star Ocean The Secondy Story R, however the side quests tracking is much more confusing. There is no real indication where you are supposed to go or what to do, and often if you miss the initial conversation with the NPC giving you the quest, it's almost impossible to complete it without looking it up on a guide. Most of quests revolve in just finding some material or item drop from monsters, with no indication where those monsters are or even which monsters they are, sometimes. Personally, I just skipped a lot of the side quests since, with the exception of a couple, they really don't do much and the rewards are laughable.\n\n\n\nAnother very minor complaint is that the UI font often is very small, so people with low resolution/size screen or vision problems might find it hard to play.\n\n\n\nOverall, I'd rate the game's difficulty as \"Hard\". If you have played Star Ocean The Second Story R, I think this one is harder language-wise, but the UI (except for the quest tracking) is much more streamlined and easier to follow. If The Second Story was \"Hard\" close to bieng \"Average\", this one is \"Hard\" close to being \"Very Hard\" in my book, so be aware.\n",
        "browsable": true
    },
    {
        "title": "Star Ocean: The Second Story R",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "not supported",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "main and side quest",
        "backlog": "partial",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co6nmh.jpg",
        "backloggd": "https://www.backloggd.com/games/star-ocean-the-second-story-r/",
        "howlongtobeat": "https://howlongtobeat.com/game/130455",
        "playtime": "average",
        "notes": "\n\n\nA remake of an older star ocean game. The remake itself is quite amazing honestly and the artstyle is very charming.\n\n\n\nLanguage-wise, it's pretty average for a sci-fi fantasy game, there are a few technical terms here and there that might throw people off a bit, and some made up words that you kinda need to intuit from context but that also aren't really fundamental to understand the core of the story.\n\n\n\nFor whatever odd reason, the text rendering engine does not support furigana at all, but sometimes the writers will throw in some alternative readings or help the player with some readings by adding the kana in brackets next to the word, but it's relatively rare (maybe like 10-15 times in a whole playthrough).\n\n\n\nThe game has a lot to read, and a very broad set of characters with two main characters and two different storylines/point of views so there's quite a decent replayability. Not all characters can be recruited in each playthrough so if you are the kind of person to enjoy exploring all options, you'll be stuck playing this game for a while (there are apparently 99 different ending combinations, with all character pairs).\n\n\n\nIt is \"mostly\" fully voiced for the main story and side content, including most of the character personal actions (like private skits), although a few here and there aren't voiced for some reason. All other interactions with random NPCs in town are not voiced though.\n\n\n\nOne thing that felt a bit overwhelming was the complex skill and crafting system. There is a lot to do and a lot of options to customize and make builds, although by the end you are able to acquire all or almost all of skills/passive boosts so I wouldn't worry too much about it. There is quite a bit of menu reading though and the descriptions can be a bit hard to follow.\n\n\n\nSpecifically for this last reason, I decided to mark it as hard in language difficulty rather than average.\n\n\n\nOne thing to also keep in mind is that there is a dialogue log scrollback that can be viewed, however it is only accessible during cutscenes and as soon as the cutscene ends or changes the scrollback is wiped and cannot be accesssed anymore, which is why I marked it as partial instead of full.\n",
        "browsable": true
    },
    {
        "title": "Stella of the End",
        "genre": "visual novel",
        "difficulty": "average",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co743p.jpg",
        "backloggd": "https://www.backloggd.com/games/stella-of-the-end/",
        "vndb": "https://vndb.org/v29443",
        "jpdb": "https://jpdb.io/visual-novel/7543/tsui-no-stella",
        "howlongtobeat": "https://howlongtobeat.com/game/114136",
        "playtime": "average",
        "furigana": "unknown",
        "notes": "\n\n\nThe game has a decent amount of sci-fi technical language, but overall I did not find it particularly hard to follow. All dialogues are voiced but the narration parts are not, which is par of the course for visual novels anyway. Difficulty wise I'd say this is about average.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Kuro no Kiseki II - Crimson Sin",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co5bec.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-kuro-no-kiseki-ii-crimson-sin/",
        "howlongtobeat": "https://howlongtobeat.com/game/115699",
        "playtime": "long",
        "notes": "\n\n\nKuro no Kiseki 2 is the sequel to Kuro no Kiseki 1 (duh) and it plays out mostly the same. There's not really much to say about it, except maybe the playtime is a bit shorter than its predecessor (still pretty long). Language-wise, it's pretty much the same, and if you haven't played Kuro 1 you really shouldn't be playing this.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails in the Sky",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co7ybm.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-in-the-sky/",
        "jpdb": "https://jpdb.io/video-game/5316/trails-in-the-sky",
        "howlongtobeat": "https://howlongtobeat.com/game/10011",
        "playtime": "long",
        "notes": "\n\n\nThis is the first game in the trails series, and the first part of the Trails in the Sky trilogy.\n\n\n\nOkay, I'll be honest with you, I actually did not play this game in Japanese. I played it years before I learned Japanese, in English. However, I did play through the entire series in Japanese, and I played Trails in the Sky: SC (the sequel), and the two games are pretty much the same so whatever I say about that one will apply here too.\n\n\n\nThis series is very long, but so much worth it. I think if you get into it starting from this entry and manage to get through all the other entries in the series, your level of Japanese understanding will become incredibly solid.\n\n\n\nIt is a series with lots of writing and lots of text, many NPCs, and you will not run out of lines to read for sure.\n\n\n\nTrails in the Sky itself is the first entry, and the language is probably the easiest of them all (except for Nayuta, which I cover in its own page), but I would not consider it easy either. The story is pretty straightforward and starts off with very low stakes. You just travel around the country as two trainer bracers (kinda mercenaries) and take on sidequests which fill  your quest log (there are mostly no quest markers so you're on your own in figuring out where to go).\n\n\n\nSome versions of this game also have voice acting, if you have the steam version there are patches to add voice acting from the Japanese version (however I didn't do that so I don't know how extensive it is). The usage of furigana is somewhat limited but it will come up often enough either in made-up words, or for some of the more complicated terminology.\n\n\n\nThe real hard part of this game is dealing with side quests and missable content. There is a lot to follow and every single step of the story ends up unlocking more events and some of them have a very limited window before they expire. If you don't want to backtrack and speak to every single NPC multiple times after every minor story event, I honestly recommend playing this game using a walkthrough.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails in the Sky SC",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co74em.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-in-the-sky-sc/",
        "jpdb": "https://jpdb.io/video-game/5317/trails-in-the-sky-sc",
        "howlongtobeat": "https://howlongtobeat.com/game/31863",
        "playtime": "long",
        "notes": "\n\n\nSequel to the Trails in the Sky (FC) game entry. I recommend reading the notes from that entry because my commentary and advice stays exactly the same. There is really no difference between the two games as this one is just the second half/continuation of the story from the first one.\n\n\n\nRealistically speaking, if you played the first entry, you already know what to expect here and should be more than capable enough to deal with this one too. If you haven't played the first entry, you really should because the story in this one will not make much sense otherwise.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails in the Sky the 3rd",
        "genre": "jrpg",
        "difficulty": "average",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co23da.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-in-the-sky-the-3rd/",
        "jpdb": "https://jpdb.io/video-game/5318/trails-in-the-sky-the-3rd",
        "howlongtobeat": "https://howlongtobeat.com/game/10013",
        "playtime": "long",
        "notes": "\n\n\nThis is the third entry of the Trails in the Sky trilogy. After the conclusion of Sora FC and SC, we come back to (mostly) the same cast of characters, however the main character and structure of the narrative are a bit different.\n\n\n\nUnlike the first two games, this game is much more linear and is closer to a dungeon crawler. Without spoiling the story, you're basically stuck in a specific map/part of the world, and slowly advance down a dungeon while tackling new challenges and encountering fragments of the story which end up expanding on the lore of the first two games and the overall Trails universe.\n\n\n\nFor this reason, I think the difficulty in the Japanese for this game is a bit lower than its predecessors. You don't have missable side quests or semi-open world exploration, so you really cannot get lost.\n\n\n\nThe gameplay is still mostly the same, and if you have played the other two games, you will be fine with this one too (and if you haven't, go play them!)\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails Into Reverie",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co3bb2.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-into-reverie/",
        "jpdb": "https://jpdb.io/video-game/8492/trails-into-reverie",
        "howlongtobeat": "https://howlongtobeat.com/game/82480",
        "playtime": "very long",
        "notes": "\n\n\nTrails into Reverie / Hajimari no Kiseki is a standalone entry that merges the storylines of the Crossbell dualogy (Zero, Ao no kiseki) and the Erebonian quadrilogy (Cold Steel) into a grand finale of a story. If you haven't played (at the very least) Trails of Cold Steel, you should not be playing this because it would be very confusing.\n\n\n\nThere are multiple routes with multiple protagonists, and the game is split between a main story and some dungeon exploration with side events and lore explanations in a similar fashion to Trails in the Sky the 3rd.\n\n\n\nLanguage-wise, there is some complicated lore and background exposition, but I felt it was not as hard into politics like the Cold Steel series, so I think \"hard\" rather than \"very hard\" is a reasonable assessment.\n\n\n\nThe rest of the game plays pretty much the same as its predecessors, so by now you should be very familiar with how these games work.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails of Cold Steel",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co44ma.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-of-cold-steel/",
        "jpdb": "https://jpdb.io/video-game/5319/trails-of-cold-steel",
        "howlongtobeat": "https://howlongtobeat.com/game/14320",
        "playtime": "long",
        "notes": "\n\n\nTrails of Cold Steel marks the beginning of the Erebonia quadrilogy of the Trails series. While I personally recommend starting with Trails in the Sky, this is also a decent entry point in the series and the first \"modern\" 3D game, which might be more palatable as an entry point.\n\n\n\nStarting from this game, the series begins to have more approachable quality-of-life, like some quest and event markers on the map. This makes it easier to navigate the story even without a walkthrough, however there are still plenty of missable events. I still recommend playing these with a guide if you want to experience the full story.\n\n\n\nLanguage-wise, the game is not that different from its predecessors, however the narrative starts getting more political. The story takes place in the Erebonian empire and deals with a lot of political intrigue, scheming, and various factions of noblemen and other families, some of which speak with very pompous and sometimes archaic language. Some of the military ranks, political roles, and major names in the story can also be hard to follow.\n\n\n\nThis is compounded by the fact that the game presents some very inconsistent voice acting, even more than its predecessors. Even within the main story, some characters seem to be voiced or unvoiced randomly, sometimes even mid-conversation, which can throw the player off track if they rely too much on the voices instead of reading.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails of Cold Steel II",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co44mb.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-of-cold-steel-ii/",
        "jpdb": "https://jpdb.io/video-game/5320/trails-of-cold-steel-ii",
        "howlongtobeat": "https://howlongtobeat.com/game/23196",
        "playtime": "long",
        "notes": "\n\n\nCold Steel 2 is the second entry in the Cold Steel arc of the Trails / Kiseki series.\n\n\n\nMy commentary/notes for this game are pretty much the same as those for Cold Steel 1, so I just recommend reading those. But anyways, you shouldn't really be playing this game unless you have at least played Cold Steel 1, as the story is a straight continuation of its predecessor.\n\n\n\nIf you managed to get through Cold Steel 1, you'll do fine with this one too.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails of Cold Steel III",
        "genre": "jrpg",
        "difficulty": "very hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "partial",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1mkb.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-of-cold-steel-iii/",
        "jpdb": "https://jpdb.io/video-game/5321/trails-of-cold-steel-iii",
        "howlongtobeat": "https://howlongtobeat.com/game/55663",
        "playtime": "very long",
        "notes": "\n\n\nCold Steel 3 marks the second half of the Erebonian quadrilogy. If you haven't played the previous cold steel games and, ideally, the Sky and Crossbell arcs too, I strongly recommend you do so because otherwise this game and its sequel will be very hard to follow.\n\n\n\nDifficulty-wise, the language is mostly the same as the previous two games, however there are a few differences. First off, we finally get a backlog feature, which can be of great help if you need to re-read dialogues and conversations. Unfortunately, the voice acting is still as inconsistent as ever. The game adds a few more quest and event markers and I feel like starting from this entry it might be more acceptable to stop using a walkthrough as you will likely be able to come across most missable events (although I still recommend using one just in case).\n\n\n\nDespite the language being mostly the same, the story starts to pick up a lot of complexity as more and more parts of the lore start falling into place and the cast of characters keeps growing (including those from the two previous arcs). The length of the game is also bigger than its predecessors, meaning there's much more to read, and the political language keeps increasing. For this reason I consider this game to very hard.\n\n\n\nBut still, if you managed to get this far with the series, you'll do fine.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails of Cold Steel IV",
        "genre": "jrpg",
        "difficulty": "very hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "partial",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co31wc.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-of-cold-steel-iv/",
        "jpdb": "https://jpdb.io/video-game/5322/trails-of-cold-steel-iv",
        "howlongtobeat": "https://howlongtobeat.com/game/69471",
        "playtime": "very long",
        "notes": "\n\n\nThis is the culmination of the Erebonian quadrilogy of the Trails / Kiseki series.\n\n\n\nOverall, this is mostly the same as its predecessor. There are a few more quality of life improvements but language/feature-wise it plays out the same as Cold Steel 3. The story keeps getting more complicated and the lore expands, so I still consider this to be very hard, and the length of this game was astronomical to me. There's a lot of side content and side quests.\n\n\n\nIf you did fine with Cold Steel 3, you'll do fine with this one too.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails through Daybreak",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co7uf7.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-through-daybreak/",
        "jpdb": "https://jpdb.io/video-game/8491/kuro-no-kiseki",
        "howlongtobeat": "https://howlongtobeat.com/game/94547",
        "playtime": "very long",
        "notes": "\n\n\nTrails through Daybreak / Kuro no Kiseki is the first entry in the new Kiseki arc that takes place in the Calvard republic.\n\n\n\nStory-wise, it takes place a few years after the events in Trails into Reverie, with an almost entirely brand new cast of characters and locations to explore.\n\n\n\nWhile I would not recommend starting the Kiseki series from here, it can still be considered a decent entry point if you don't want to go through the Sky trilogy or the Cold Steel quadrilogy (but why wouldn't you? they are great!).\n\n\n\nLanguage-wise, it's very similar to its predecessors, however it's not as filled with politics and political language so it might be more approachable. The amount of quality of life improvements in this game are massive compared to its predecessors and it finally feels like a modern game. A lot of the new gameplay elements are action-based and might be a bit harder to follow but you'll get used to them quickly enough, especially if you played through the previous entries.\n\n\n\nUnfortunately, just like its predecessors, the amount of voiced lines is incredibly inconsistent. There are main story segments with randomly voiced characters in the middle of non-voiced conversations.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Trails to Azure",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "main quest",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co5ahi.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-trails-to-azure/",
        "jpdb": "https://jpdb.io/video-game/5323/trails-to-azure",
        "howlongtobeat": "https://howlongtobeat.com/game/10598",
        "playtime": "long",
        "backlog": "unknown",
        "notes": "\n\n\nTrails to Azure / Ao no Kiseki is the second entry in the Crossbell dualogy, sequel to Zero no Kiseki.\n\n\n\nDifficulty-wise, the game is pretty much the same as its predecessor. I felt like maybe the language got a bit harder towards the end as you get thrown into a much larger plot (this is a theme that will come back in the Cold Steel games) but it's still relatively okay to follow. If you made it this far in the kiseki universe in Japanese, you will be fine with this game too.\n\n\n\nAs always, use a walkthrough, although I'd stay away from the neoseeker (English) walkthrough. It has some references and spoilers for the Cold Steel games. The person who wrote it really can't stop giving their commentary about stuff and it really annoyed me.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Heroes: Zero no Kiseki",
        "genre": "jrpg",
        "difficulty": "hard",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "main quest",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co7527.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-heroes-zero-no-kiseki/",
        "jpdb": "https://jpdb.io/video-game/5315/trails-from-zero",
        "howlongtobeat": "https://howlongtobeat.com/game/10599",
        "playtime": "long",
        "backlog": "unknown",
        "notes": "\n\n\nTrails from Zero / Zero no Kiseki is the first entry in the Crossbell arc dualogy. This game and its sequel, Ao no Kiseki, take place in the city state of Crossbell, after the events of the Trails in the Sky trilogy.\n\n\n\nThere are some recurring elements and quests referenced from Trails in the Sky, and it is very much strongly advised to go play that trilogy first. This is also very important for the main story, as some parts are continuations of story branches that started in the previous trilogy.\n\n\n\nThe difficulty of the Japanese in this game is more or less on par with the Trails in the Sky trilogy, and the gameplay structure is mostly the same. Like its predecessors, it has missable quests and events, and the core gameplay loop is mostly the same. You take the role of a special police force who is tasked to go around Crossbell and take on side quests and tasks, eventually uncovering some broader plot and stuff going on.\n\n\n\nIf you have played the previous games, you will be fine with these too. If you haven't, I strongly recommend you do.\n\n\n\nAs for the previous entries as well, I recommend playing these with a walkthrough so you can better enjoy the story without missing important events.\n",
        "browsable": true
    },
    {
        "title": "The Legend of Nayuta: Boundless Trails",
        "genre": "jrpg",
        "difficulty": "average",
        "furigana": "mostly no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co3bb1.jpg",
        "backloggd": "https://www.backloggd.com/games/the-legend-of-nayuta-boundless-trails/",
        "howlongtobeat": "https://howlongtobeat.com/game/6426",
        "playtime": "average",
        "backlog": "unknown",
        "notes": "\n\n\nJust from the title, Nayuta no Kiseki might look like just another Trails / Kiseki game, but it's an almost completely different thing. It is a spin-off story that takes place in a completely different world, with different characters, and the gameplay is also very different. It's an action JRPG with levels/stages, rather than a pseudo-open world turn based party based JRPG. You take control of one and only one character: Nayuta, and have to swing your sword and use magic to defeat enemies.\n\n\n\nThe story is not too complicated and is partially (but not entirely) voiced. I think overall it's a very nice entry into the genre if you're not a complete beginner anymore and want a bit of a healthy (but not too much) challenge.\n\n\n\nPlaytime-wise it's not very long, at least compared to the other kiseki games, and it does not overstay its welcome.\n",
        "browsable": true
    },
    {
        "title": "Utawarerumono: Mask of Deception",
        "genre": "visual novel",
        "difficulty": "hard",
        "furigana": "partial",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1w6u.jpg",
        "backloggd": "https://www.backloggd.com/games/utawarerumono-mask-of-deception/",
        "vndb": "https://vndb.org/v7721",
        "howlongtobeat": "https://howlongtobeat.com/game/43227",
        "playtime": "very long",
        "notes": "\n\n\nUtawarerumono: Mask of Deception is the sequel to Utawarerumono: Prelude to the Fallen and the first entry in the \"Mask\" dualogy.\n\n\n\nWhile it is entirely possible to start the series from this entry, as the story is mostly self-contained, I strongly recommend to read Prelude first since the experience will be so much better that way.\n\n\n\nAll in all, the difficulty is not that different from Prelude and most of the stuff I mentioned about Prelude will apply to this game as well.\n\n\n\nThe main difference that I noticed is that the writing style changed quite a bit from its predecessor. This one feels much more like a \"proper\" visual novel. There are a lot more descriptions, narrative parts, and non-voiced portions that are more common to see in visual novels than videogames. Although there are still gameplay elements, they seem much less than in Prelude.\n\n\n\nFor this reason, and because the length is much longer too, I consider the difficulty to be a bit higher and rate it as \"Hard\" rather than \"Average\".\n\n\n\nStill, it's probably one of the best visual novels I've ever read and I strongly recommend it. In my opinion it has the absolute most amazing ending of any piece of written media I've ever read and it's totally worth it.\n",
        "browsable": true
    },
    {
        "title": "Utawarerumono: Mask of Truth",
        "genre": "visual novel",
        "difficulty": "hard",
        "furigana": "partial",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1w6v.jpg",
        "backloggd": "https://www.backloggd.com/games/utawarerumono-mask-of-truth/",
        "vndb": "https://vndb.org/v18717",
        "howlongtobeat": "https://howlongtobeat.com/game/43228",
        "playtime": "very long",
        "notes": "\n\n\nUtawarerumono: Mask of Truth is the sequel to Utawarerumono: Mask of Deception and the conclusion of the main Utawarerumono trilogy.\n\n\n\nIt is the second half of the story that follows from Mask of Deception. These two games should be considered pretty much the same as one is a direct continuation. The language is exactly the same and gameplay elements as well.\n\n\n\nFor this reason, I rate it exactly the same as Mask of Deception. I recommend reading that entry for more details.\n",
        "browsable": true
    },
    {
        "title": "Utawarerumono: Prelude to the Fallen",
        "genre": "visual novel",
        "difficulty": "average",
        "furigana": "partial",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1z54.jpg",
        "backloggd": "https://www.backloggd.com/games/utawarerumono-prelude-to-the-fallen/",
        "vndb": "https://vndb.org/v3",
        "jpdb": "https://jpdb.io/visual-novel/3841/utawarerumono",
        "howlongtobeat": "https://howlongtobeat.com/game/78781",
        "playtime": "long",
        "notes": "\n\n\nUtawarerumono: Prelude to the Fallen is the first entry in the Utawarerumono series. I strongly recommend new players to the series to start from this, before moving on to the Mask of Deception / Mask of Truth dualogy.\n\n\n\nThe game is a mix of Visual Novel and turn-based strategy game. This first entry specifically is still towards the more \"game\" side of things, as the visual novel portions are very dialogue driven with very little descriptions. Most of the scenes are presented from the point of view of the main character and his inner thoughts. This means it's voiced for almost all of the scene, aside from a few rare narrative descriptions which remain unvoiced.\n\n\n\nThe level of Japanese is not particularly complicated however there are a few things that stand out that I think are worth mentioning.\n\n\n\nFirst, the game makes use of some odd kanji choices. For example it will always use 躰 instead of 身体, and use 判る instead of 分かる, you just have to get used to it. On top of that, there are a lot of really weird katakana words for names and stuff (I think they resemble some Ainu folklore but I am not sure), and those can be quite hard to go through sometimes. It also uses very specific in-universe words with common kanji but weird katakana furigana. It took me a while to remember them and distinguish between them since they are all very similar.\n\n\n\nOn top of all that, a lot of characters speak in very distinct speech patterns and styles, with sometimes very weird sentence endings that can throw off some less experienced readers.\n\n\n\nStill, overall, I think the difficulty is average for an VN mixed with RPG elements and strongly recommend it to anyone who want to get into this series, it's an amazing experience.\n",
        "browsable": true
    },
    {
        "title": "White Album: Memories Like Falling Snow",
        "genre": "visual novel",
        "difficulty": "average",
        "furigana": "no",
        "japanese_game": "yes",
        "pausable_text": "all",
        "voiced": "partial",
        "backlog": "full",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co6kod.jpg",
        "backloggd": "https://www.backloggd.com/games/white-album-memories-like-falling-snow/",
        "vndb": "https://vndb.org/v236",
        "jpdb": "https://jpdb.io/visual-novel/952/white-album",
        "howlongtobeat": "https://howlongtobeat.com/game/129676",
        "playtime": "average",
        "notes": "\n\n\nNOTE: THIS IS WHITE ALBUM 1, NOT WHITE ALBUM 2\n\n\n\nI needed to put that disclaimer up there, because everyone really loves White Album 2 and always talks about it, but this is (the remake of) White Album 1, which I almost never hear people talk about.\n\n\n\nIt's a pretty standard run-of-the-mill visual novel. You talk to people, go through a calendar-based system and every day you choose which event/location to attend and which character to talk to. Sometimes (often) you have to choose which topics to bring up to each character and doing that will give you specific affection points and eventually lock you into a specific route or event.\n\n\n\nThe language difficulty is pretty average, it takes place in everyday Japan (somewhere in the 90s if I understood correctly), so most of the language will be everyday stuff with some specific jargon from the idol/showbusiness world as the main heroines are idols and the main character works in the industry.\n\n\n\nThere is no furigana and often you will go for a long time without knowing what a certain character's name is, simply because no one mentioned it yet. The narration and main character dialogue lines are unvoiced, but all the other characters are fully voiced.\n\n\n\nIf you like a simple VN with average language difficulty, this is a good starting point in my opinion.\n",
        "browsable": true
    },
    {
        "title": "Yakuza 0",
        "genre": "action",
        "difficulty": "hard",
        "furigana": "not supported",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co252x.jpg",
        "backloggd": "https://www.backloggd.com/games/yakuza-0/",
        "howlongtobeat": "https://howlongtobeat.com/game/43056",
        "playtime": "long",
        "notes": "\n\n\nI played this game a few years ago so my memory is a bit spotty as I try to remember the biggest pain points and details of it.\n\n\n\nThe yakuza series is massive, and this is the usually recommended entry point (either this, Yakuza Kiwami, or Yakuza 7), so chances are you might not be acquainted to the level and style of language which might make it harder than some later entries in the series.\n\n\n\nThe game makes heavy use of Yakuza slang, and on top of that there's quite a bit of game that takes place in Osaka and one of the main character speaks in Osaka dialect. This means it's not exactly an easy game to get into language-wise, hence I'd consider it hard in difficulty.\n\n\n\nMost of the main story content is voiced, but the rest of the side quests and side content is not. Plus, there is no furigana and, if I remember correctly, there is no backlog either. Some of the \"live\" cutscenes also don't have pausable text meaning you need to understand tham in real-time or manually pause them yourself as you go.\n\n\n\nOne thing that distinguishes this from later entries in the series is that it takes place in the showa era, and the interface kinda shows. There are quite a bit of kanji used in the game menu and UI that normally would be written in katakana or have an English interface instead, which adds to the complexity of it.\n",
        "browsable": true
    },
    {
        "title": "Yakuza Kiwami",
        "genre": "action",
        "difficulty": "hard",
        "furigana": "not supported",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co1pbc.jpg",
        "backloggd": "https://www.backloggd.com/games/yakuza-kiwami/",
        "howlongtobeat": "https://howlongtobeat.com/game/39484",
        "playtime": "average",
        "notes": "\n\n\nThis is another possible entry point for people new to the Yakuza/Ryu ga gotoku series.\n\n\n\nMore or less, it's about the same complexity as Yakuza 0, except there's a bit less kansai dialect and a lot more yakuza slang.\n\n\n\nIf you managed to get through Yakuza 0, you should be fine with this one too. If not, you might struggle a bit as you get up to speed with the Yakuza slang. Refer to the Yakuza 0 entry for more details and comments about the difficulty of the series.\n",
        "browsable": true
    },
    {
        "title": "Yakuza Kiwami 2",
        "genre": "action",
        "difficulty": "hard",
        "furigana": "not supported",
        "japanese_game": "yes",
        "pausable_text": "some",
        "voiced": "partial",
        "backlog": "no",
        "image": "https://images.igdb.com/igdb/image/upload/t_cover_big/co22ss.jpg",
        "backloggd": "https://www.backloggd.com/games/yakuza-kiwami-2/",
        "howlongtobeat": "https://howlongtobeat.com/game/49620",
        "playtime": "average",
        "notes": "\n\n\nThis is the sequel to Yakuza Kiwami 1. It does not differ much from the first one, language-wise, and I recommend you play that one first (and Yakuza 0 too while you're at it). The difficulty is about the same.\n",
        "browsable": true
    }
]